#include <iostream>
#include <fstream>
#include "use_lib.h"
#include "nlohmann/json.hpp"

using namespace std;
using json = nlohmann::json;

void save_data();

void solution_2()
{
    setlocaleRus();
    cout << "\n::::::::::::::::: SOLUTION 2 ::::::::::::::::::\n";

    save_data();

    ifstream in_file("../../data/movies.json");
    json data;
    if (in_file.is_open()) {
        data = json::parse(in_file);
        in_file.close();
    } else {
        cout << "DATA FILE NOT FOUND OR CORRUPT. ABORT.\n";
        return;
    }

    //cout << data.dump(4) << endl;
    cout << data[0]["Название"] << endl;
    cout << data[1]["Название"] << endl;

//    cout << data["В главных ролях"]["Chili Palmer"] << endl;

}

void save_data() {

    json movies_data
    {
            {
                    {"Название", "Операция Ы и другие приключения Шурика"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"В ролях",
                            {
                                    {"Александр Демьяненко", "Шурик"},
                                    {"Наталья Селезнёва", "Лида"},
                                    {"Юрий Никулин", "Балбес"},
                                    {"Георгий Вицин", "Трус"},
                                    {"Евгений Моргунов", "Бывалый"}
                            }
                    }
            },
            {
                    {"Название", "Бриллиантовая рука"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"В ролях",
                            {
                                    {"Андрей Миронов", "Геннадий Козодоев"},
                                    {"Анатолий Папанов", "Лёлик"},
                                    {"Юрий Никулин", "Семен Горбунков"},
                                    {"Нонна Мордюкова", "Управдом"},
                                    {"Нина Гребешкова", "Надежда Горбункова"}
                            }
                    }
            },
            {
                    {"Название", "Бриллиантовая рука"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"В ролях",
                            {
                                    {"Андрей Миронов", "Геннадий Козодоев"},
                                    {"Анатолий Папанов", "Лёлик"},
                                    {"Юрий Никулин", "Семен Горбунков"},
                                    {"Нонна Мордюкова", "Управдом"},
                                    {"Нина Гребешкова", "Надежда Горбункова"}
                            }
                    }
            }

    };


    ofstream o_file("../../data/movies.json");
    if (o_file.is_open()) {
        o_file << movies_data.dump(4) << endl;
        o_file.flush();
        o_file.close();
    }

}