#include <iostream>
#include <fstream>
#include <windows.h>
#include "use_lib.h"
#include "nlohmann/json.hpp"
#define FILE_NAME "../../data/movies.json"

using namespace std;
using json = nlohmann::json;

void save_data();
json read_data();

void solution_2()
{
    setlocaleUTF8();

    cout << "\n::::::::::::::::: SOLUTION 2 ::::::::::::::::::\n\n";

    //save_data(); // уберите комментарий если нужно создать файл JSON заново
    json data = read_data();

    cout << "Загружена информация о фильмах:\n\n";
    for (int i = 0; i < data.size(); i++) {
        cout << "\t № " << i + 1 << " :: " << data[i]["Название"] << " :: (" << data[i]["Премьера"] << ")\n";
    }

    string command;
    do {
        clearStdin();
        cout << "\nВведите название фильма или имя/фамилию актера для просмотра информации.\n";
        cout << "Необязательно вводить полную информацию, достаточно частично, а мы поищем: ";
        command = getCommand();
        if (command.length() <= 3) {
            cout << "\nВведено менее 4 символов, попробуйте еще раз\n";
            continue;
        }
        cout << "\nCOMMAND = " << command << endl;

        // сначала ищем название фильма
        bool movie_found = false;
        for (auto & i : data) {
            string name = i["Название"];
            if (name.find(command) != string::npos) {
                cout << "\nНайдена информация о фильме: \"" << name << "\"\n\n";
                cout << i.dump(4) << endl;
                movie_found = true;
                break;
            }
        }
        if (!movie_found)
            cout << "\n\t:::::::: Информация по имени фильма не найдена ::::::::\n";

        // ищем информацию по актерам


    } while (command != "exit");

}

json read_data() {

    ifstream in_file(FILE_NAME);
    json data = nullptr;
    if (in_file.is_open()) {
        data = json::parse(in_file);
        in_file.close();
    } else {
        cout << "DATA FILE NOT FOUND OR CORRUPT. ABORT.\n";
    }
    return data;
}

void save_data() {

    json movies_data
    {
            {
                    {"Название", "Операция Ы и другие приключения Шурика"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"Премьера","23 июля 1965"},
                    {"В ролях",
                            {
                                    {"Александр Демьяненко", "Шурик"},
                                    {"Наталья Селезнёва", "Лида"},
                                    {"Юрий Никулин", "Балбес"},
                                    {"Георгий Вицин", "Трус"},
                                    {"Евгений Моргунов", "Бывалый"}
                            }
                    }
            },
            {
                    {"Название", "Бриллиантовая рука"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"Премьера","28 апреля 1969"},
                    {"В ролях",
                            {
                                    {"Андрей Миронов", "Геннадий Козодоев"},
                                    {"Анатолий Папанов", "Лёлик"},
                                    {"Юрий Никулин", "Семен Горбунков"},
                                    {"Нонна Мордюкова", "Управдом"},
                                    {"Нина Гребешкова", "Надежда Горбункова"}
                            }
                    }
            },
            {
                    {"Название", "Кавказская пленница, или Новые приключения Шурика"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"Премьера","1 апреля 1967"},
                    {"В ролях",
                            {
                                    {"Александр Демьяненко", "Шурик"},
                                    {"Наталья Варлей", "Нина"},
                                    {"Юрий Никулин", "Балбес"},
                                    {"Георгий Вицин", "Трус"},
                                    {"Евгений Моргунов", "Бывалый"}
                            }
                    }
            },
            {
                    {"Название", "Старики-разбойники"},
                    {"Режиссер", "Эльдар Рязанов"},
                    {"Сценарий", "Эмиль Брагинский, Эльдар Рязанов"},
                    {"Композитор", "Андрей Петров"},
                    {"Премьера","7 августа 1972"},
                    {"В ролях",
                            {
                                    {"Юрий Никулин", "Николай Мячиков"},
                                    {"Евгений Евстигнеев", "Воробьев"},
                                    {"Ольга Аросева", "Анна Суздалева"},
                                    {"Андрей Миронов", "Юрий Проскудин"},
                                    {"Георгий Бурков", "Фёдор Федяев"}
                            }
                    }
            },
            {
                    {"Название", "Они сражались за Родину"},
                    {"Режиссер", "Сергей Бондарчук"},
                    {"Сценарий", "Сергей Бондарчук, Михаил Шолохов"},
                    {"Композитор", "Вячеслав Овчинников"},
                    {"Премьера","12 мая 1975"},
                    {"В ролях",
                            {
                                    {"Василий Шукшин", "Петр Лопахин"},
                                    {"Вячеслав Тихонов", "Николай Стрельцов"},
                                    {"Сергей Бондарчук", "Иван Звягинцев"},
                                    {"Георгий Бурков", "Александр Копытовский"},
                                    {"Юрий Никулин", "рядовой Некрасов"}
                            }
                    }
            }
    };


    ofstream o_file(FILE_NAME);
    if (o_file.is_open()) {
        o_file << movies_data.dump(4) << endl;
        o_file.flush();
        o_file.close();
    }

}