#include <iostream>
#include <fstream>
#include "use_lib.h"
#include "nlohmann/json.hpp"
#define FILE_NAME "../../data/movies.json"

using namespace std;
using json = nlohmann::json;

json read_data();
void save_data();
bool seekMovie(string& command, const json& jsonData);
void seekActor(string& command, const json& jsonData);

/**
 * Создает и записывает на диск информацию о пяти фильмах СССР
 * Загружает с диска Json файл с информацией о фильмах, парсит данные в память
 * По введенным буквам, цифрам, словам или обрывкам слов ищет все совпадения:
 * - по названию фильма, и выводит информацию по найденным совпадениям
 * - по имени, фамилии актера выводит список ролей в найденных фильмах
 */
void solution_2() {

    setlocaleUTF8();
    cout << "\n::::::::::::::::: SOLUTION 2 ::::::::::::::::::\n\n";

    //save_data(); // уберите комментарий если нужно создать файл JSON заново
    json data = read_data();
    if (data == nullptr) return;

    cout << "Загружена информация о фильмах:\n\n";
    for (int i = 0; i < data.size(); i++) {
        cout << "\t № " << i + 1 << " :: " << data[i]["Название"] << " :: (" << data[i]["Премьера"] << ")\n";
    }

    string comm;
    do {
        clearStdin();
        cout << "\nВведите название фильма или имя/фамилию актера для просмотра информации.\n";
        cout << "Необязательно вводить полную информацию, достаточно частично, вдруг повезет: ";
        comm = getCommand();
        if (comm.empty()) continue;
        cout << "Вами введено: " << comm << endl;

        // сначала ищем название фильма
        seekMovie(comm, data);

        // ищем информацию по актерам
        seekActor(comm, data);

    } while (comm != "exit");

}

void seekActor(string& command, const json& jsonData) {

    cout << endl;
    bool not_found = true;
    for (auto & movie : jsonData) {
        for (auto & roles : movie["В ролях"]) {
            string actor = roles.back();
            if (actor.find(command) != string::npos) {
                if (not_found) {
                    cout << "РЕЗУЛЬТАТЫ ПОИСКА ПО АРТИСТУ:\n";
                    not_found = false;
                }
                cout << "\t" << roles.back() << " :: " << roles.front() << " :: " << movie["Название"] << endl;
            }
        }
    }
    if (not_found) {
        cout << "\n\t:::::::: Информация по актеру не найдена ::::::::\n";
    }
}

bool seekMovie(string& command, const json& jsonData) {

    bool not_found = true;
    for (auto & movie : jsonData) {
        string name = movie["Название"];
        to_lower(name);
        if (name.find(command) != string::npos) {
            not_found = false;
            cout << "\nНАЙДЕНА ИНФОРМАЦИЯ О ФИЛЬМЕ:\n\n";
            cout << "\tНазвание:\t" << movie["Название"] << endl;
            cout << "\tРежиссер:\t" << movie["Режиссер"] << endl;
            cout << "\tСценарист:\t" << movie["Сценарий"] << endl;
            cout << "\tКомпозитор:\t" << movie["Композитор"] << endl;
            cout << "\tВ ролях:\n";
            for (auto & actors : movie.at("В ролях")) {
                cout << "\t\t" << actors.front() << " :: " << actors.back() << endl;
            }
        }
    }
    if (!not_found) return true;
    cout << "\n\t:::::::: Информация по названию фильма не найдена ::::::::\n";
    return false;
}

json read_data() {

    ifstream in_file(FILE_NAME);
    json data = nullptr;
    if (in_file.is_open()) {
        data = json::parse(in_file);
        in_file.close();
    } else {
        cout << "DATA FILE NOT FOUND OR CORRUPT. ABORT.\n";
    }
    return data;
}

void save_data() {

    json movies_data
    {
            {
                    {"Название", "Операция Ы и другие приключения Шурика"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"Премьера","23 июля 1965"},
                    {"В ролях",
                            {
                                    {"1",{"Шурик", "Александр Демьяненко"}},
                                    {"2",{"Лида", "Наталья Селезнёва"}},
                                    {"3",{"Балбес", "Юрий Никулин"}},
                                    {"4",{"Трус", "Георгий Вицин"}},
                                    {"5",{"Бывалый", "Евгений Моргунов"}}
                            }
                    }
            },
            {
                    {"Название", "Бриллиантовая рука"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"Премьера","28 апреля 1969"},
                    {"В ролях",
                            {
                                    {"1",{"Геннадий Козодоев", "Андрей Миронов"}},
                                    {"2",{"Лёлик", "Анатолий Папанов"}},
                                    {"3",{"Семен Горбунков", "Юрий Никулин"}},
                                    {"4",{"Управдом", "Нонна Мордюкова"}},
                                    {"5",{"Надежда Горбункова", "Нина Гребешкова"}}
                            }
                    }
            },
            {
                    {"Название", "Кавказская пленница, или Новые приключения Шурика"},
                    {"Режиссер", "Леонид Гайдай"},
                    {"Сценарий", "Леонид Гайдай, Яков Костюковский, Морис Слободской"},
                    {"Композитор", "Александр Зацепин"},
                    {"Премьера","1 апреля 1967"},
                    {"В ролях",
                            {
                                    {"1",{"Шурик", "Александр Демьяненко"}},
                                    {"2",{"Нина", "Наталья Варлей"}},
                                    {"3",{"Балбес", "Юрий Никулин"}},
                                    {"4",{"Трус", "Георгий Вицин"}},
                                    {"5",{"Бывалый", "Евгений Моргунов"}}
                            }
                    }
            },
            {
                    {"Название", "Старики-разбойники"},
                    {"Режиссер", "Эльдар Рязанов"},
                    {"Сценарий", "Эмиль Брагинский, Эльдар Рязанов"},
                    {"Композитор", "Андрей Петров"},
                    {"Премьера","7 августа 1972"},
                    {"В ролях",
                            {
                                    {"1",{"Николай Мячиков", "Юрий Никулин"}},
                                    {"2",{"Воробьев", "Евгений Евстигнеев"}},
                                    {"3",{"Анна Суздалева", "Ольга Аросева"}},
                                    {"4",{"Юрий Проскудин", "Андрей Миронов"}},
                                    {"5",{"Фёдор Федяев", "Георгий Бурков"}}
                            }
                    }
            },
            {
                    {"Название", "Они сражались за Родину"},
                    {"Режиссер", "Сергей Бондарчук"},
                    {"Сценарий", "Сергей Бондарчук, Михаил Шолохов"},
                    {"Композитор", "Вячеслав Овчинников"},
                    {"Премьера","12 мая 1975"},
                    {"В ролях",
                            {
                                    {"1",{"Петр Лопахин", "Василий Шукшин"}},
                                    {"2",{"Николай Стрельцов", "Вячеслав Тихонов"}},
                                    {"3",{"Иван Звягинцев", "Сергей Бондарчук"}},
                                    {"4",{"Александр Копытовский", "Георгий Бурков"}},
                                    {"5",{"рядовой Некрасов", "Юрий Никулин"}}
                            }
                    }
            }
    };

    ofstream o_file(FILE_NAME);
    if (o_file.is_open()) {
        o_file << movies_data.dump(4) << endl;
        o_file.flush();
        o_file.close();
    }
}